---
kind: other
id: Properties.T:Autodesk.Revit.DB.LogicalAndFilter
source: html/6b110a94-383b-53f5-4f4e-ca748a78c0c9.htm
---
# LogicalAndFilter Properties

True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected,
 and elements that would normally be rejected will be accepted.